pmo-dataset/graphviz/15.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Gather evidence" -> "ParallelGateway_2";
  "ParallelGateway_1" -> "Conduct\nself-assessment";
  "Issue official\ndocuments" -> "ExclusiveGateway_2";
  "ParallelGateway_2" -> "Conduct external\naudit";
  "ExclusiveGateway_2" -> "end";
  "ExclusiveGateway_1" -> "Award certification";
  "Identify gaps or\nissues" -> "Make necessary\ncorrections or\nimprovements";
  "Conduct external\naudit" -> "Identify gaps or\nissues";
  "Schedule compliance\naudit" -> "ParallelGateway_1";
  "Prepare\ndocumentation" -> "ParallelGateway_2";
  "Conduct\nself-assessment" -> "ParallelGateway_2";
  "Award certification" -> "Issue official\ndocuments";
  "start" -> "Schedule compliance\naudit";
  "Make necessary\ncorrections or\nimprovements" -> "Conduct final audit";
  "ParallelGateway_1" -> "Gather evidence";
  "ExclusiveGateway_1" -> "ExclusiveGateway_2";
  "ParallelGateway_1" -> "Prepare\ndocumentation";
  "Conduct final audit" -> "ExclusiveGateway_1";

  "start" [shape=circle];
  "end" [shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
}
