pmo-dataset/mermaid/15.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	Task_9["Gather evidence"] --> ParallelGateway_2{"+"}
	ParallelGateway_1{"+"} --> Task_1["Conduct\nself-assessment"]
	Task_3["Issue official\ndocuments"] --> ExclusiveGateway_2{"X"}
	ParallelGateway_2 --> Task_4["Conduct external\naudit"]
	ExclusiveGateway_2 --> EndNoneEvent_1(("end")):::endEvent
	ExclusiveGateway_1{"X"} --> Task_5["Award certification"]
	Task_7["Identify gaps or\nissues"] --> Task_2["Make necessary\ncorrections or\nimprovements"]
	Task_4 --> Task_7
	Task_6["Schedule compliance\naudit"] --> ParallelGateway_1
	Task_8["Prepare\ndocumentation"] --> ParallelGateway_2
	Task_1 --> ParallelGateway_2
	Task_5 --> Task_3
	StartNoneEvent_1(("start")) --> Task_6
	Task_2 --> Task_10["Conduct final audit"]
	ParallelGateway_1 --> Task_9
	ExclusiveGateway_1 --> ExclusiveGateway_2
	ParallelGateway_1 --> Task_8
	Task_10 --> ExclusiveGateway_1
